src/Services/Air/templates/AIR_PRICE_REQ.xml

<!--Release 8.1-->
<!--Version Dated as of 15/Apr/2015 11:24:06-->
<!--Air Pricing For Galileo(1G) with LFS CheckFlightDetails Request-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Header/>
    <soap:Body>
        <air:AirPriceReq AuthorizedBy="user" CheckFlightDetails="true" TargetBranch="{{TargetBranch}}" TraceId="{{requestId}}"
                         xmlns:air="http://www.travelport.com/schema/air_v36_0">
            <com:BillingPointOfSaleInfo OriginApplication="UAPI" xmlns:com="http://www.travelport.com/schema/common_v36_0"/>
            <air:AirItinerary>
                {{#segments}}
                <air:AirSegment ArrivalTime="{{arrival}}"
                                DepartureTime="{{departure}}"
                                Carrier="{{airline}}"
                                {{#if bookingClass}} ClassOfService="{{bookingClass}}" {{/if}}
                                CabinClass="{{serviceClass}}"
                                Origin="{{from}}"
                                Destination="{{to}}"
                                ETicketability="Yes"
                                Equipment="{{plane}}"
                                FlightNumber="{{flightNumber}}"
                                LinkAvailability="true"
                                PolledAvailabilityOption="Polled avail exists"
                                ProviderCode="1G"
                                Key="{{@index}}"
                                Group="0">
                </air:AirSegment>
                {{#if transfer}}
                <air:Connection/>
                {{/if}}
                {{/segments}}
            </air:AirItinerary>
            <air:AirPricingModifiers InventoryRequestType="Direct">
                {{#if business}}
                <air:PermittedCabins>
                    <com:CabinClass Type="Business" xmlns:com="http://www.travelport.com/schema/common_v36_0" />
                </air:PermittedCabins>
                {{/if}}
            </air:AirPricingModifiers>
        {{#passengers}}
            <com:SearchPassenger Key="P_{{@index}}" Code="{{ageCategory}}" Age="{{Age}}" xmlns:com="http://www.travelport.com/schema/common_v36_0"/>
            {{/passengers}}
            {{#if hasFareBasis}}
            <air:AirPricingCommand>
                {{#segments}}
                <air:AirSegmentPricingModifiers AirSegmentRef="{{@index}}" FareBasisCode="{{fareBasisCode}}"/>
                {{/segments}}
            </air:AirPricingCommand>
            {{/if}}
        </air:AirPriceReq>
    </soap:Body>
</soap:Envelope>
